require('dotenv').config();

const { Client } = require('@notionhq/client');


const fs = require('fs');


// alchemy sdkをimport
// const { Network, Alchemy } = require('alchemy-sdk');

//本番環境
const client = new Client({ auth: process.env.WAGUMI_SAMURAI_API_TOKEN });

const users = [
  "407535019897126913",
  "340699948620185602",
  "450293970493505536",
  "402820738568028160",
  "905976270217695283",
  "927991390917492808",
  "686023579631878145",
  "488544515976724480",
  "783349189680824360",
  "937906941257199667",
  "972123668073300009",
  "985747779508928512",
  "989535807083794432",
  "782060287892783145",
  "735393975846043678",
  "917755486466609172",
  "1008731868163756065",
  "955615767460741151",
  "1008238376245276732",
  "905603213917585450",
  "710388387726753852",
  "820197383643201568",
  "935134928025313320",
  "966550381230436362",
  "596920177111597067",
  "915144168173617213",
  "903518534246748201",
  "1047128688233295933",
  "952031831123976202",
  "1003085522152980500",
  "476660876712345600",
  "713326590905286666",
  "895920784340549684",
  "496541494480601092",
  "999278464983105606",
  "791076667476410391",
  "915271495561932901",
  "920631003788230657",
  "673206951114571797",
  "612205069835829274",
  "1049187954465198090",
  "802192187093549108",
  "921797667577802772",
  "382191570004475905",
  "944816063009423371",
  "770099433089269770",
  "719476939764531283",
  "1047332065869299773",
  "1012125187384291448",
  "731557466311098418",
  "908624402617344001",
  "990487001025372201",
  "542932468718895104",
  "824998670855307274",
  "770970845120167966",
  "853516261811421184",
  "1036597980557475872",
  "465330052373151756",
  "1017099906038648984",
  "674433273853640767",
  "1042023043247128616",
  "1019127772255358977",
  "376679157427339264",
  "1047279179630137525",
  "739371457683128400",
  "759591545933791252",
  "980240676430151750",
  "964687284752498768",
  "1053936871014666342",
  "768826254093844511",
  "1057546247193497640",
  "724625636106436752",
  "809128177976344696"
]

const createMetadata = () => {
      try {

        const numberList = {}
        const idList = {}

        // const readDir = fs.readdirSync('src/experiment/reputation');
        for(const user of users) {
          if(!readFile(user)) {
            idList[user] = 0;
            console.log(idList[user]);
            continue;
          };
          const json = JSON.parse(fs.readFileSync(`src/experiment/reputation/${user}.json`));
          // if(!numberList[json.length.toString()]) { numberList[json.length.toString()] = 0};
          // numberList[json.length.toString()] ++;
          // const id = file.replace(/.json/, "")
          idList[user] = json.length;
          console.log(idList[user]);
        }

    } catch (error) {
      console.error('create metadata failed',error);
    }
};

const readFile = (user) => {
  return(fs.existsSync(`src/experiment/reputation/${user}.json`)); 
}
  
  
    // const pushContributionPage = async (pages) => {
    //   for (const page of pages.results) {
    //       console.log(page);
    //     }
    // };

  (async () => {
      createMetadata();
  })();
